# Задача 3. Таблица стоимости
# Одна единица некоторого товара стоит x рублей. Напечатайте таблицу стоимости 2, 3, ..., 20 единиц этого товара.
# Формат входных данных
# Вводится одно положительное вещественное число x, которое не превосходит 105 и задано с двумя знаками после запятой.

# пример:
# Входные данные
# 9.99
# Выходные данные
# 1 9.99 Rub.
# 2 19.98 Rub.
# 3 29.97 Rub.
# 4 39.96 Rub.
# 5 49.95 Rub.
# 6 59.94 Rub.
# 7 69.93 Rub.
# 8 79.92 Rub.
# 9 89.91 Rub.
# 10 99.90 Rub.
# 11 109.89 Rub.
# 12 119.88 Rub.
# 13 129.87 Rub.
# 14 139.86 Rub.
# 15 149.85 Rub.
# 16 159.84 Rub.
# 17 169.83 Rub.
# 18 179.82 Rub.
# 19 189.81 Rub.
# 20 199.80 Rub.

n = float(input('n?')) 


print('# 1 ',n * 1,' Rub.')
print('# 2 ',n * 2,' Rub.')
print('# 3 ',n * 3,' Rub.')
print('# 4 ',n * 4,' Rub.')
print('# 5 ',n * 5,' Rub.')
print('# 6 ',n * 6,' Rub.')
print('# 7 ',n * 7,' Rub.')
print('# 8 ',n * 8,' Rub.')
print('# 9 ',n * 9,' Rub.')
print('# 10 ',n * 10,' Rub.')
print('# 11 ',n * 11,' Rub.')
print('# 12 ',n * 12,' Rub.')
print('# 13 ',n * 13,' Rub.')
print('# 14 ',n * 14,' Rub.')
print('# 15 ',n * 15,' Rub.')
print('# 16 ',n * 16,' Rub.')
print('# 17 ',n * 17,' Rub.')
print('# 18 ',n * 18,' Rub.')
print('# 19 ',n * 19,' Rub.')
print('# 20 ',n * 20,' Rub.')
